src/object-diagram/logic/test-suites/linked-list/tests/3/writer/expected.gv
digraph ObjectDiagram {
  node [shape=plaintext]
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;[StackFrame]&gt;&gt;</i></td></th>
    <tr><td align="left">args</td><td align="left" port="args"></td></tr>
    <tr><td align="left">list</td><td align="left" port="list"></td></tr>
  </table>>]
  _482d9dec6ff954d68d94793f765be61dbc59cb47 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;String[]&gt;&gt;</i></td></th>
    <tr><td colspan="2">[]</td></tr>
  </table>>]
  _7f72fde5bcfbd3fa5f2426e64a749e253c7dc602 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;LinkedList&gt;&gt;</i></td></th>
    <tr><td align="left">head</td><td align="left" port="head"></td></tr>
  </table>>]
  _228d691985f93beaed469d085317435fb3665ef9 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;LinkedList$Node&gt;&gt;</i></td></th>
    <tr><td align="left">next</td><td align="left" port="next"></td></tr>
    <tr><td align="left">value</td><td align="left" port="value"></td></tr>
  </table>>]
  _d2865ba5ee220622dea76e88fc2636f5678302a5 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;LinkedList$Node&gt;&gt;</i></td></th>
    <tr><td align="left">next</td><td align="left" port="next"></td></tr>
    <tr><td align="left">value</td><td align="left" port="value"></td></tr>
  </table>>]
  _9216cc81275965426f13a25b0d4cc5251cf83d7c [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;LinkedList$Node&gt;&gt;</i></td></th>
    <tr><td align="left">next</td><td align="left" port="next">null</td></tr>
    <tr><td align="left">value</td><td align="left" port="value"></td></tr>
  </table>>]
  _6c8ee4d6b87c98cd376adf5b3a8536fbe38a8afa [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;String&gt;&gt;</i></td></th>
    <tr><td colspan="2">"3"</td></tr>
  </table>>]
  _aa72d35e21c1d6132dbb8e75f8fbc7117c4f423d [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;String&gt;&gt;</i></td></th>
    <tr><td colspan="2">"2"</td></tr>
  </table>>]
  _25f504355ec07b115120e557c385e256ddbe8e4e [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;String&gt;&gt;</i></td></th>
    <tr><td colspan="2">"1"</td></tr>
  </table>>]
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:args -> _482d9dec6ff954d68d94793f765be61dbc59cb47
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:list -> _7f72fde5bcfbd3fa5f2426e64a749e253c7dc602
  _7f72fde5bcfbd3fa5f2426e64a749e253c7dc602:head -> _228d691985f93beaed469d085317435fb3665ef9
  _228d691985f93beaed469d085317435fb3665ef9:next -> _d2865ba5ee220622dea76e88fc2636f5678302a5
  _d2865ba5ee220622dea76e88fc2636f5678302a5:next -> _9216cc81275965426f13a25b0d4cc5251cf83d7c
  _9216cc81275965426f13a25b0d4cc5251cf83d7c:value -> _6c8ee4d6b87c98cd376adf5b3a8536fbe38a8afa
  _d2865ba5ee220622dea76e88fc2636f5678302a5:value -> _aa72d35e21c1d6132dbb8e75f8fbc7117c4f423d
  _228d691985f93beaed469d085317435fb3665ef9:value -> _25f504355ec07b115120e557c385e256ddbe8e4e
}
